package io.higgus.lab;
import org.springframework.boot.SpringApplication;
import org.springframework.boot.autoconfigure.SpringBootApplication;




@SpringBootApplication
public class MassApplication {
    public static final String BRAND_BLUE = "\u001B[38;2;29;80;163m";
    public static final String RESET = "\u001B[0m";

    public static void main(String[] args) {
        SpringApplication.run(MassApplication.class, args);

        System.out.print(
                BRAND_BLUE +
                        "     (♥◠‿◠)ﾉﾞ        Mass 启动成功！        ლ(´ڡ`ლ)ﾞ\n" +
                        " ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▄\n" +
                        "░░░░░░░░▄▐░▄▄█████▄▄\n" +
                        "░░░░░░▄█████████████▄▀▄▄░▄▄▄\n" +
                        "░░░░░█████████████████▄██████\n" +
                        "░░░░████▐█████▌████████▌█████▌\n" +
                        "░░░████▌█████▌█░████████▐▀██▀\n" +
                        "░▄█████░█████▌░█░▀██████▌█▄▄▀▄\n" +
                        "░▌███▌█░▐███▌▌░░▄▄░▌█▌███▐███░▀\n" +
                        "▐░▐██░░▄▄▐▀█░░░▐▄█▀▌█▐███▐█\n" +
                        "░░███░▌▄█▌░░▀░░▀██░░▀██████▌\n" +
                        "░░░▀█▌▀██▀░▄░░░░░░░░░███▐███\n" +
                        "░░░░██▌░░░░░░░░░░░░░▐███████▌\n" +
                        "░░░░███░░░░░▀█▀░░░░░▐██▐███▀▌\n" +
                        "░░░░▌█▌█▄░░░░░░░░░▄▄████▀░▀\n" +
                        "░░░░░░█▀██▄▄▄░▄▄▀▀▒█▀█░▀\n" +
                        "░░░░░░░░░▀░▀█▀▌▒▒▒░▐▄▄\n" +
                        "░░░░░░░░▄▄▀▀▄░░░░░░▄▀░▀▀▄▄\n" +
                        "░░░░░░▄▀░▄▀▄░▌░░░▄▀░░░░░░▄▀▀▄\n" +
                        "░░░░░▐▒▄▀▄▀░▌▀▄▄▀░░░░░░▄▀▒▒▒▐\n" +
                        "░░░░▐▒▒▌▀▄░░░░░▌░░░░▄▄▀▒▐▒▒▒▒▌\n" +
                        "░░░▐▒▒▐░▌░▀▄░░▄▀▀▄▀▀▒▌▒▐▒▒▒▒▐▐\n" +
                        "░░░▌▄▀░░░▄▀░█▀▒▒▒▒▀▄▒▌▐▒▒▒▒▒▌▌\n" +
                        "░░▄▀▒▐░▄▀░░░▌▒▐▒▐▒▒▒▌▀▒▒▒▒▒▐▒▌\n" +
                        "██████████▌▓▓    ▒▒▒▒    ▓██████ \n" +
                        RESET
        );
    }
}